; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v6 ?v4)
             (pred_2 ?v1 ?v8)
             (pred_9 ?v6 ?v8)
             (pred_10 ?v11 ?v6 )
	     (pred_11 ?v6)
             (pred_8 ?v9)
             (pred_12 ?v1)
             (pred_7 ?v8)
             (pred_5 ?v6)
             (pred_3 ?v1)
             (pred_1 ?v6)
             (pred_6 ))



(:action op_3
:parameters (?v10 ?v2 ?v13 ?v3)
:precondition (and (pred_8 ?v10) (pred_8 ?v2) (pred_12 ?v13) (pred_7 ?v3)
          (pred_4 ?v10 ?v2) (pred_2 ?v13 ?v3)
                   (pred_9 ?v2 ?v3) (pred_11 ?v10) 
                   (pred_5 ?v2) (pred_3 ?v13))
:effect (and  (pred_1 ?v2) (not (pred_5 ?v2))))


(:action op_5
:parameters (?v10 ?v12)
:precondition (and (pred_8 ?v10) (pred_8 ?v12)
               (pred_11 ?v10) (pred_4 ?v10 ?v12) (pred_1 ?v12))
:effect (and (pred_11 ?v12) (not (pred_11 ?v10))))

(:action op_4
:parameters (?v10 ?v13)
:precondition (and (pred_8 ?v10) (pred_12 ?v13) 
                  (pred_11 ?v10) (pred_10 ?v13 ?v10) (pred_6 ))
:effect (and (pred_3 ?v13)
   (not (pred_10 ?v13 ?v10)) (not (pred_6 ))))


(:action op_1
:parameters (?v10 ?v7 ?v5)
:precondition (and (pred_8 ?v10) (pred_12 ?v7) (pred_12 ?v5)
                  (pred_11 ?v10) (pred_3 ?v5) (pred_10 ?v7 ?v10))
:effect (and (pred_3 ?v7) (pred_10 ?v5 ?v10)
        (not (pred_3 ?v5)) (not (pred_10 ?v7 ?v10))))

(:action op_2
:parameters (?v10 ?v13)
:precondition (and (pred_8 ?v10) (pred_12 ?v13) 
                  (pred_11 ?v10) (pred_3 ?v13))
:effect (and (pred_6 ) (pred_10 ?v13 ?v10) (not (pred_3 ?v13)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_02 obj_04 obj_01 obj_03 obj_13 obj_06 obj_05 obj_08 obj_09
    obj_10 obj_07
    obj_12 obj_11
    )

    (:init
       (pred_6)

       (pred_8 obj_02)
       (pred_8 obj_04)
       (pred_8 obj_01)
       (pred_8 obj_03)
       (pred_8 obj_13)
       (pred_8 obj_06)
       (pred_8 obj_05)
       (pred_8 obj_08)
       (pred_8 obj_09)
       (pred_7 obj_10)
       (pred_7 obj_07)
       (pred_12 obj_12)
       (pred_12 obj_11)

       (pred_4 obj_02 obj_03)
       (pred_4 obj_02 obj_04)
       (pred_4 obj_04 obj_13)
       (pred_4 obj_04 obj_01)
       (pred_4 obj_04 obj_02)
       (pred_4 obj_01 obj_06)
       (pred_4 obj_01 obj_04)
       (pred_4 obj_03 obj_05)
       (pred_4 obj_03 obj_13)
       (pred_4 obj_03 obj_02)
       (pred_4 obj_13 obj_08)
       (pred_4 obj_13 obj_06)
       (pred_4 obj_13 obj_04)
       (pred_4 obj_13 obj_03)
       (pred_4 obj_06 obj_09)
       (pred_4 obj_06 obj_01)
       (pred_4 obj_06 obj_13)
       (pred_4 obj_05 obj_08)
       (pred_4 obj_05 obj_03)
       (pred_4 obj_08 obj_09)
       (pred_4 obj_08 obj_13)
       (pred_4 obj_08 obj_05)
       (pred_4 obj_09 obj_06)
       (pred_4 obj_09 obj_08)
       (pred_5 obj_02)
       (pred_5 obj_05)
       (pred_9  obj_02 obj_10)
       (pred_9  obj_05 obj_07)
       (pred_1 obj_04)
       (pred_1 obj_01)
       (pred_1 obj_03)
       (pred_1 obj_13)
       (pred_1 obj_06)
       (pred_1 obj_08)
       (pred_1 obj_09)

       (pred_2  obj_12 obj_10)
       (pred_2  obj_11 obj_07)
       (pred_10 obj_12 obj_08)
       (pred_10 obj_11 obj_04)
       (pred_11 obj_06)
    )

    (:goal (and
       (pred_10 obj_12 obj_02)
       (pred_10 obj_11 obj_01)
    ))
(:constraints
  (always (not (pred_11 obj_13)))
)
)

; plan
1. (op_5 obj_06 obj_01)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_01)
   goals met: 0 of 2
2. (op_5 obj_01 obj_04)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_04)
   goals met: 0 of 2
3. (op_4 obj_04 obj_11)
   deleted: (pred_10 obj_11 obj_04) (pred_6)
   added: (pred_3 obj_11)
   goals met: 0 of 2
4. (op_5 obj_04 obj_01)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_01)
   goals met: 0 of 2
5. (op_2 obj_01 obj_11)
   deleted: (pred_3 obj_11)
   added: (pred_6) (pred_10 obj_11 obj_01)
   goals met: 1 of 2
6. (op_5 obj_01 obj_06)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_06)
   goals met: 1 of 2
7. (op_5 obj_06 obj_09)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_09)
   goals met: 1 of 2
8. (op_5 obj_09 obj_08)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_08)
   goals met: 1 of 2
9. (op_4 obj_08 obj_12)
   deleted: (pred_10 obj_12 obj_08) (pred_6)
   added: (pred_3 obj_12)
   goals met: 1 of 2
10. (op_5 obj_08 obj_09)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_09)
   goals met: 1 of 2
11. (op_5 obj_09 obj_06)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_06)
   goals met: 1 of 2
12. (op_5 obj_06 obj_01)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_01)
   goals met: 1 of 2
13. (op_5 obj_01 obj_04)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_04)
   goals met: 1 of 2
14. (op_3 obj_04 obj_02 obj_12 obj_10)
   deleted: (pred_5 obj_02)
   added: (pred_1 obj_02)
   goals met: 1 of 2
15. (op_5 obj_04 obj_02)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_02)
   goals met: 1 of 2
16. (op_2 obj_02 obj_12)
   deleted: (pred_3 obj_12)
   added: (pred_6) (pred_10 obj_12 obj_02)
   goals met: 2 of 2
